{"id": "693b52a4e247e87ce0bfc411", "total_sentences": 10, "sentences_needing_improvement": 0, "sentences": [{"text": "So hello everyone. I am Vik Shant. So today we'll be learning about the OOPS.", "start": 0.0, "end": 4.8, "duration": 4.8, "needs_improvement": false, "improvement": {"reason": "Error: 429 You exceeded your current quota, please check your plan and billing details. For more informatio", "suggestion": ""}}, {"text": "OOPS. Object-oriented programming. We'll take a real simple example of a coffee machine and we'll see. So think of the coffee machine as a class. It's like a blueprint.", "start": 4.8, "end": 13.6, "duration": 8.8, "needs_improvement": false, "improvement": {"reason": "Error: 429 You exceeded your current quota, please check your plan and billing details. For more informatio", "suggestion": ""}}, {"text": "It defines the functions of a coffee machine like making a coffee, making a cappuccino, a latte, etc. Now when you buy a real coffee machine, it's like an object. Right?", "start": 13.6, "end": 22.400000000000002, "duration": 8.8, "needs_improvement": false, "improvement": {"reason": "Error: 429 You exceeded your current quota, please check your plan and billing details. For more informatio", "suggestion": ""}}, {"text": "It just buy it and place it on a table, like an object. Now let's come to the OOPS part of it.", "start": 22.400000000000002, "end": 26.88, "duration": 4.48, "needs_improvement": false, "improvement": {"reason": "Error: 429 You exceeded your current quota, please check your plan and billing details. For more informatio", "suggestion": ""}}, {"text": "So the OOPS has four different pillars. The first one is encapsulation. Now what is the capsule? It's the capsule, right? What is the capsule? It has some medicine inside and it's hidden by the outer capsule. Now in terms of the coffee machine, a coffee machine has some internal wiring, it has a heating element, it has a coffee grinder, it's all hidden under the outer casing.", "start": 26.959999999999997, "end": 44.879999999999995, "duration": 17.92, "needs_improvement": false, "improvement": {"reason": "Error: 429 You exceeded your current quota, please check your plan and billing details. For more informatio", "suggestion": ""}}, {"text": "Now this is encapsulation like bundling of data and hiding under the casing. Now moving onto the next one, it is abstraction. Now it may seem like a big term but it really isn't.", "start": 44.879999999999995, "end": 54.32, "duration": 9.44, "needs_improvement": false, "improvement": {"reason": "Error: 429 You exceeded your current quota, please check your plan and billing details. For more informatio", "suggestion": ""}}, {"text": "Now suppose I want an espresso. Now how do you say to the machine like I just press a button off, I press one and it gives me an espresso. I don't care about the steps to make an espresso, right? That is handled by the machine. So it is the machine is abstracting the function to make an espresso and simply giving me a button. That is abstraction. Moving on to the next one, inheritance. Now inheritance is really simple. It's like you inherit your father's property.", "start": 54.4, "end": 78.64, "duration": 24.24, "needs_improvement": false, "improvement": {"reason": "Error: 429 You exceeded your current quota, please check your plan and billing details. For more informatio", "suggestion": ""}}, {"text": "Right? Now in terms of the coffee machine, like suppose you have a smaller coffee machine and then your budget increases and you buy a premium one. Now suppose the smaller one only makes espresso and heats up water. And the premium one, it makes tapuccino, it makes elate and also makes definitely makes an espresso and heats up water, right? So it is inheriting the properties of the base one and also addigates own properties. Now think in terms of cars, you have a base version and then you have a higher end model. Now obviously the higher end model has all the features of the base one plus some extra features, right? Now moving on to the last one with the spawning Now it seems like a complex term, but it's really simple. What it simply means is many forms or multiple forms. Now suppose I have two coffee machines, one of brand X and one of brand Y. Now I know I have a same button brew on both of them. Now when I press the brew button on the brand X, it makes an espresso. When I press the same button on brand Y, it makes a filter coffee.", "start": 79.28, "end": 133.44, "duration": 54.16, "needs_improvement": false, "improvement": {"reason": "Error: 429 You exceeded your current quota, please check your plan and billing details. For more informatio", "suggestion": ""}}, {"text": "Now the same function, the same button performs multiple function. It appears in multiple forms.", "start": 133.44, "end": 139.36, "duration": 5.92, "needs_improvement": false, "improvement": {"reason": "Error: 429 You exceeded your current quota, please check your plan and billing details. For more informatio", "suggestion": ""}}, {"text": "That is polymorphism. That's right time guys. I have my vaccine everything well. Thank you so much.", "start": 139.36, "end": 145.60000000000002, "duration": 6.24, "needs_improvement": false, "improvement": {"reason": "Error: 429 You exceeded your current quota, please check your plan and billing details. For more informatio", "suggestion": ""}}]}