{"id": "693ae74f604b0b7124b7c08a", "total_sentences": 18, "sentences_needing_improvement": 3, "sentences": [{"text": "So hello everyone, I am Vik Shant. So today we will be learning about the OOPS.", "start": 0.0, "end": 4.88, "duration": 4.88, "needs_improvement": true, "improvement": {"reason": "OOPS is introduced without defining what it stands for or its purpose.", "suggestion": "Hello everyone, I am Vik Shant. Today we will be learning about OOPS, which stands for Object-Oriented Programming, a fundamental paradigm in software development."}}, {"text": "OOPS. Object-oriented program. We will take a real simple example of a coffee machine and we will see.", "start": 4.88, "end": 10.32, "duration": 5.44, "needs_improvement": true, "improvement": {"reason": "The term 'Object-oriented program' should be 'Object-oriented programming' for accuracy.", "suggestion": "OOPS, or Object-Oriented Programming, is what we'll explore today using a simple example of a coffee machine."}}, {"text": "So think of the coffee machine as a class. It is like a blueprint. It defines the functions of a coffee machine like making a coffee, making a cappuccino, a latte, etc. Now, when you buy a real coffee machine, it is like an object.", "start": 10.32, "end": 22.240000000000002, "duration": 11.92, "needs_improvement": false, "improvement": {"reason": "", "suggestion": ""}}, {"text": "Right? It is by it and placed on a table, like an object. Now let us come to the OOPS part of it. So the OOPS has four different pillars. The first one is encapsulation.", "start": 22.240000000000002, "end": 30.56, "duration": 8.32, "needs_improvement": false, "improvement": {"reason": "", "suggestion": ""}}, {"text": "Now what is the capsule? It is the capsule, right? What is the capsule? It has some medicine inside and it is hidden by the outer capsule. Now in terms of the coffee machine, a coffee machine has some internal wiring, it has a heating element, it has a coffee grinder.", "start": 30.56, "end": 42.480000000000004, "duration": 11.92, "needs_improvement": false, "improvement": {"reason": "", "suggestion": ""}}, {"text": "It is all hidden under the outer casing. Now this is encapsulation like bundling of data and hiding under the casing. Now moving on to the next one, it is abstraction.", "start": 42.480000000000004, "end": 51.44, "duration": 8.96, "needs_improvement": false, "improvement": {"reason": "", "suggestion": ""}}, {"text": "Now it may seem like a big term but it really isn't. Now suppose I want an espresso.", "start": 51.519999999999996, "end": 56.16, "duration": 4.64, "needs_improvement": false, "improvement": {"reason": "", "suggestion": ""}}, {"text": "Now how do you see the machine like I just press a button off, I press one and it gives me an espresso.", "start": 56.16, "end": 60.4, "duration": 4.24, "needs_improvement": false, "improvement": {"reason": "", "suggestion": ""}}, {"text": "I don't care about the steps to make an espresso like that is handled by the machine.", "start": 60.4, "end": 64.48, "duration": 4.08, "needs_improvement": false, "improvement": {"reason": "", "suggestion": ""}}, {"text": "So it is the machine is abstracting the function to make an espresso and simply giving me a button.", "start": 64.48, "end": 70.32, "duration": 5.84, "needs_improvement": false, "improvement": {"reason": "", "suggestion": ""}}, {"text": "That is abstraction. Moving on to the next one, it is inheritance.", "start": 71.03999999999999, "end": 75.12, "duration": 4.08, "needs_improvement": false, "improvement": {"reason": "", "suggestion": ""}}, {"text": "Now inheritance is really simple. It is like you inherit your father's property.", "start": 75.12, "end": 78.64, "duration": 3.52, "needs_improvement": false, "improvement": {"reason": "", "suggestion": ""}}, {"text": "Now in terms of the coffee machine, suppose you have a smaller coffee machine and then your budget increases and you buy a premium one. Now suppose a smaller one only makes espresso and heats up water.", "start": 79.28, "end": 90.08, "duration": 10.8, "needs_improvement": false, "improvement": {"reason": "", "suggestion": ""}}, {"text": "And the premium one, it makes tapu chino, it makes alate and it definitely makes an espresso and heats up water. So it is inheriting the properties of the base one and also addigates own properties. Now think in terms of cars, you have a base version and then you have a higher end model. Now obviously the higher end model has all the features of the base one plus some extra features. Now moving on to the last one with this fallen morphism. Now it seems like a complex stone, but it is really simple. What it simply means is many forms or multiple forms.", "start": 90.08, "end": 118.72, "duration": 28.64, "needs_improvement": true, "improvement": {"reason": "'fallen morphism' is a transcription error for 'polymorphism', which needs correction for the technical term.", "suggestion": "And the premium one, it makes cappuccino, it makes a latte, and it definitely makes an espresso and heats up water. So it is inheriting the properties of the base one and also adding its own properties. Now think in terms of cars: you have a base version, and then you have a higher-end model. Obviously, the higher-end model has all the features of the base one plus some extra features. Now, moving on to the last pillar, which is polymorphism. It may seem like a complex term, but it is really simple, meaning 'many forms' or 'multiple forms'."}}, {"text": "Now suppose I have two coffee machines, one of brand X and one of brand Y.", "start": 118.72, "end": 123.19999999999999, "duration": 4.48, "needs_improvement": false, "improvement": {"reason": "", "suggestion": ""}}, {"text": "Now I know I have a same button, brew on both of them. Now when I press the brew button on the brand X, it makes an espresso. When I press the same button on brand Y, it makes a filter coffee.", "start": 123.19999999999999, "end": 133.44, "duration": 10.24, "needs_improvement": false, "improvement": {"reason": "", "suggestion": ""}}, {"text": "Now the same function, the same button performs multiple functions, it appears in multiple forms.", "start": 133.44, "end": 139.35999999999999, "duration": 5.92, "needs_improvement": false, "improvement": {"reason": "", "suggestion": ""}}, {"text": "That is polymorphism. That's right time guys. I have my vaccine everything well. Thank you so much.", "start": 139.92, "end": 145.52, "duration": 5.6, "needs_improvement": false, "improvement": {"reason": "", "suggestion": ""}}]}