{"id": "693b4c59658b139888a39295", "total_sentences": 8, "sentences_needing_improvement": 0, "sentences": [{"text": "So hello everyone, I am Vik Shant, so today we will be learning about the oops. Object oriented programming. We will take a real simple example of a coffee machine and we will see. So think of the coffee machine as a class. It's like a blueprint. It defines the functions of a coffee machine like making a coffee, making a cappuccino, Allah the Exeter, Now, when you buy a real coffee machine, it's like an object, right? It just buy it and place it on a table, like an object.", "start": 0.0, "end": 25.12, "duration": 25.12, "needs_improvement": false, "improvement": {"reason": "Error: 429 You exceeded your current quota, please check your plan and billing details. For more informatio", "suggestion": ""}}, {"text": "Now let's come to the oops part of it. So the oops has four different pillars. The first one is encapsulation. Now what is the capsule? It's like capsule, right? What is the capsule? It has a medicine inside and it's hidden by the outer capsule. Now in terms of the coffee machine, a coffee machine has some internal wiring, it has a heating element, it has a coffee grinder, it's all hidden under the outer casing. Now this is encapsulation, like bundling of data and hiding under the casing.", "start": 25.12, "end": 49.120000000000005, "duration": 24.0, "needs_improvement": false, "improvement": {"reason": "Error: 429 You exceeded your current quota, please check your plan and billing details. For more informatio", "suggestion": ""}}, {"text": "Now moving on to the next one, it is abstraction. Now it may seem like a big term but really isn't.", "start": 49.120000000000005, "end": 54.400000000000006, "duration": 5.28, "needs_improvement": false, "improvement": {"reason": "Error: 429 You exceeded your current quota, please check your plan and billing details. For more informatio", "suggestion": ""}}, {"text": "Now suppose I want to express it. Now how do you see them to the machine? Like I just press a button off, I press one and it gives me an express. I don't care about the steps to make an express, right? That is handled by the machine. So it is, the machine is abstracting the function to make an express and simply giving me a button. That is abstraction. Moving on to the next one, this inheritance. Now inheritance is really simple. It's like you inherit your father's property, right? Now in terms of the coffee machine, like suppose you have a smaller coffee machine and then your budget increases and you buy a premium one. Now suppose the smaller one only makes espresso and heats up water. And the premium one, it makes tapuccino, it makes elate and also makes definitely makes an espresso and heats up water, right? So it is inheriting the properties of the base one and also addigates own properties. Now think in terms of cars, you have a base version and then you have a higher end model. Now obviously the higher end model has all the features of the base one plus some extra features, right? Now moving on to the last one with this fallen morphism.", "start": 54.400000000000006, "end": 112.47999999999999, "duration": 58.08, "needs_improvement": false, "improvement": {"reason": "Error: 429 You exceeded your current quota, please check your plan and billing details. For more informatio", "suggestion": ""}}, {"text": "Now it seems like a complex term, but it's really simple. What it simply means is many forms or multiple forms. Now suppose I have two coffee machines, one of brand X and one of brand Y.", "start": 112.48, "end": 123.2, "duration": 10.72, "needs_improvement": false, "improvement": {"reason": "Error: 429 You exceeded your current quota, please check your plan and billing details. For more informatio", "suggestion": ""}}, {"text": "Now and I have a same button brew on both of them. Now when I press the brew button on the brand X, it makes an espresso. When I press the same button on brand Y, it makes a filter coffee.", "start": 123.2, "end": 133.44, "duration": 10.24, "needs_improvement": false, "improvement": {"reason": "Error: 429 You exceeded your current quota, please check your plan and billing details. For more informatio", "suggestion": ""}}, {"text": "Now the same function, the same button performs multiple function. It appears in multiple forms.", "start": 133.44, "end": 139.36, "duration": 5.92, "needs_improvement": false, "improvement": {"reason": "Error: 429 You exceeded your current quota, please check your plan and billing details. For more informatio", "suggestion": ""}}, {"text": "That is body morphism. That's right time guys. I have my vaccine everything well. Thank you so much.", "start": 139.36, "end": 145.60000000000002, "duration": 6.24, "needs_improvement": false, "improvement": {"reason": "Error: 429 You exceeded your current quota, please check your plan and billing details. For more informatio", "suggestion": ""}}]}