{"id": "693b49df658b139888a39293", "total_sentences": 7, "sentences_needing_improvement": 0, "sentences": [{"text": "So hello everyone, I am Vik Shant, so today we will be learning about Oops. Object oriented programming. We will take a real simple example of a coffee machine and we will see.", "start": 0.0, "end": 10.6, "duration": 10.6, "needs_improvement": false, "improvement": {"reason": "Error: 429 You exceeded your current quota, please check your plan and billing details. For more informatio", "suggestion": ""}}, {"text": "So think of the coffee machine as a class, it is like a blueprint, it defines the functions of a coffee machine like making a coffee, making a cappuccino, allate etc. Now when you buy a real coffee machine, it is like an object, right? It is by it and placed on a table, like an object. Now let us come to the Oops part of it. So the Oops has four different pillars. The first one is encapsulation. Now what is the capsule? It is the capsule, right?", "start": 10.6, "end": 32.84, "duration": 22.24, "needs_improvement": false, "improvement": {"reason": "Error: 429 You exceeded your current quota, please check your plan and billing details. For more informatio", "suggestion": ""}}, {"text": "What is the capsule? It has a medicine inside and it is hidden by the outer capsule. Now in terms of the coffee machine, a coffee machine has some internal wiring, it has a heating element, it has a coffee grinder, it is all hidden under the outer casing. Now this is encapsulation like bundling of data and hiding under the casing. Now moving on to the next one, it is abstraction. Now it may seem like a big term but it really isn't.", "start": 32.84, "end": 54.64, "duration": 21.8, "needs_improvement": false, "improvement": {"reason": "Error: 429 You exceeded your current quota, please check your plan and billing details. For more informatio", "suggestion": ""}}, {"text": "Now suppose I want an espresso. Now how do you say to the machine like I just press a button off, I press go and it gives me an espresso. I don't care about the steps to make an espresso like that is handled by the machine. So it is, the machine is abstracting the function to make an espresso and simply giving me a button. That is abstraction. Moving on to the next one, it is inheritance. Now inheritance is really simple, it is like you inherit your father's property, right? Now in terms of the coffee machine, like suppose you have a smaller coffee machine and then your budget increases and you buy a premium one. Now suppose the smaller one only makes espresso and heats up water. And the premium one, it makes tapu chino, it makes elate and also makes, it definitely makes an espresso and heats up water, right? So it is inheriting the properties of the base one and also addigates own properties.", "start": 54.64, "end": 101.12, "duration": 46.48, "needs_improvement": false, "improvement": {"reason": "Error: 429 You exceeded your current quota, please check your plan and billing details. For more informatio", "suggestion": ""}}, {"text": "Now think in terms of cars, you have a base version and then you have a higher end model.", "start": 101.12, "end": 105.0, "duration": 3.88, "needs_improvement": false, "improvement": {"reason": "Error: 429 You exceeded your current quota, please check your plan and billing details. For more informatio", "suggestion": ""}}, {"text": "Now obviously the higher end model has all the features of the base one plus some extra features, right? Now moving on to the last one with this polymorphism. Now it seems like a complex term, but it is really simple. What it simply means is many forms or multiple forms. Now suppose I have two coffee machines, one of brand X and one of brand Y. Now and I have a same button brew on both of them. Now when I press the brew button on the brand X, it makes an espresso. When I press the same button on brand Y, it makes a filter and the same function or the same button performs multiple function. It appears in multiple forms that is polymorphism. That is right time guys. I have my vaccine everything well.", "start": 105.0, "end": 144.04000000000002, "duration": 39.04, "needs_improvement": false, "improvement": {"reason": "Error: 429 You exceeded your current quota, please check your plan and billing details. For more informatio", "suggestion": ""}}, {"text": "Thank you so much.", "start": 144.04000000000002, "end": 144.8, "duration": 0.76, "needs_improvement": false, "improvement": {"reason": "Error: 429 You exceeded your current quota, please check your plan and billing details. For more informatio", "suggestion": ""}}]}